import { Q9 } from "./Q9module.js";

describe("Q9：宣告兩個具有 5 個元素的整數陣列 arr1 和 arr2 ，並利用陣列設定初值的方式，將 arr1[0]~arr1[4] 分別設值為 2,3,1,7,9， arr2[0]~arr2[4] 分別設值為 8,7,9,3,1，將 arr1 與 arr2 兩陣列對應項相加，列印出相加後的陣列", () => {
  test(`輸入"[2, 3, 1, 7, 9]和[8, 7, 9, 3, 1]"，應輸出: "相加後的陣列: 10,10,10,10,10"`, () => {
    expect(Q9([2, 3, 1, 7, 9], [8, 7, 9, 3, 1])).toBe(
      "相加後的陣列: 10,10,10,10,10"
    );
  });
});

describe("測試 Q9 兩陣列長度不一樣的情況", () => {
  test(`輸入"[2, 3, 1, 7, 9, 1]和[8, 7, 9, 3, 1]"，應輸出: "相加後的陣列: 10,10,10,10,10,1"`, () => {
    expect(Q9([2, 3, 1, 7, 9, 1], [8, 7, 9, 3, 1])).toBe(
      "相加後的陣列: 10,10,10,10,10,1"
    );
  });
  test(`輸入"[2, 3, 1, 7, 9]和[8, 7, 9, 3, 1, 2]"，應輸出: "相加後的陣列: 10,10,10,10,10,2"`, () => {
    expect(Q9([2, 3, 1, 7, 9], [8, 7, 9, 3, 1, 2])).toBe(
      "相加後的陣列: 10,10,10,10,10,2"
    );
  });
});
