import { Q17 } from "./Q17module.js";

describe("Q17：運用 Borda Count。算出下面的候選人分數。", () => {
  test(`輸入"候選人與投票數據"，會輸出\n候選人「1」每輪分數:204分+5分+23分+21分=總得分數253分\n候選人「3」每輪分數:153分+20分+69分+63分=總得分數305分\n候選人「2」每輪分數:102分+15分+92分+42分=總得分數251分\n候選人「4」每輪分數:51分+10分+46分+84分=總得分數191分`, () => {
    const originalVoting = [
      { votes: 51, order: [1, 3, 2, 4] },
      { votes: 5, order: [3, 2, 4, 1] },
      { votes: 23, order: [2, 3, 4, 1] },
      { votes: 21, order: [4, 3, 2, 1] },
    ];
    const message = Q17(originalVoting);
    expect(message).toBe(
      `候選人「1」每輪分數:204分+5分+23分+21分=總得分數253分\n候選人「3」每輪分數:153分+20分+69分+63分=總得分數305分\n候選人「2」每輪分數:102分+15分+92分+42分=總得分數251分\n候選人「4」每輪分數:51分+10分+46分+84分=總得分數191分`
    );
  });
});

describe("測試 Q17 增加候選人、投票輪次，並更改候選人名稱、票數情形", () => {
  test(`輸入"候選人與投票數據"，會輸出\n候選人「小明」每輪分數:75分+63分+70分+35分+150分=總得分數393分\n候選人「小美」每輪分數:60分+42分+140分+7分+30分=總得分數279分\n候選人「小華」每輪分數:45分+21分+175分+14分+60分=總得分數315分\n候選人「小白」每輪分數:30分+105分+35分+28分+120分=總得分數318分\n候選人「小紅」每輪分數:15分+84分+105分+21分+90分=總得分數315分`, () => {
    const originalVoting = [
      { votes: 15, order: ["小明", "小美", "小華", "小白", "小紅"] },
      { votes: 21, order: ["小白", "小紅", "小明", "小美", "小華"] },
      { votes: 35, order: ["小華", "小美", "小紅", "小明", "小白"] },
      { votes: 7, order: ["小明", "小白", "小紅", "小華", "小美"] },
      { votes: 30, order: ["小明", "小白", "小紅", "小華", "小美"] },
    ];

    const message = Q17(originalVoting);
    expect(message).toBe(
      `候選人「小明」每輪分數:75分+63分+70分+35分+150分=總得分數393分\n候選人「小美」每輪分數:60分+42分+140分+7分+30分=總得分數279分\n候選人「小華」每輪分數:45分+21分+175分+14分+60分=總得分數315分\n候選人「小白」每輪分數:30分+105分+35分+28分+120分=總得分數318分\n候選人「小紅」每輪分數:15分+84分+105分+21分+90分=總得分數315分`
    );
  });
});
